brewery_mApp_api/app/controllers/breweries_controller.rb

SELECT "breweries".* FROM "breweries"
---
  def index
    @breweries = Brewery.all

DELETE FROM "breweries" WHERE "breweries"."id" = $1  [["id", 8]]
---
  def destroy
    @brewery.destroy

SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_brewery
      @brewery = Brewery.find(params[:id])