brewery_mApp_api/app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs"
---
  def index
    @logs = Log.all