brewery_mApp_api/app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    @user.destroy

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "see_bartell@example"], ["LIMIT", 1]]
---
    def set_user
      @user= User.where(email: params[:id])